https://Daniellem97.app.spacelift.io/stack/newstateimporttest/run/01JVVYBH8ZKR49S99KZMY9DKSH has finished

## Planning logs

```
[01JVSGWCS7CT8A56D47VDD3EC1] Planning changes with 0 custom hooks...
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-01ac7a7b920206ed1]
data.aws_ami.server_ami: Reading...
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0d1de55c7767e49e2]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-04b0ee0500216e8bb]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-0118f0a49606fdd4d]
aws_security_group.mtc_sg: Refreshing state... [id=sg-0eeb02cbbc769a39f]
data.aws_ami.server_ami: Read complete after 0s [id=ami-0e42de9d667b232f7]
aws_route.default_route2: Refreshing state... [id=r-rtb-0d1de55c7767e49e21080289494]
aws_route.default_route: Refreshing state... [id=r-rtb-0d1de55c7767e49e21080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-0fa1c4c7953dbc594]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # aws_internet_gateway.mtc_internet_gateway has been deleted
  - resource "aws_internet_gateway" "mtc_internet_gateway" {
      - id       = "igw-0118f0a49606fdd4d" -> null
        tags     = {
            "Name" = "mtc_igw2"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.mtc_public_rt has been deleted
  - resource "aws_route_table" "mtc_public_rt" {
      - id               = "rtb-0d1de55c7767e49e2" -> null
        tags             = {
            "Name" = "dev_public_rt"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_subnet.mtc_public_subnet has been deleted
  - resource "aws_subnet" "mtc_public_subnet" {
      - id                                             = "subnet-04b0ee0500216e8bb" -> null
        tags                                           = {
            "Repository" = "new2"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.mtc_vpc has been deleted
  - resource "aws_vpc" "mtc_vpc" {
      - id                               = "vpc-01ac7a7b920206ed1" -> null
        tags                             = {
            "Name" = "dev22"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mtc_igw2"
        }
      + tags_all = {
          + "Name" = "mtc_igw2"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.default_route2 will be created
  + resource "aws_route" "default_route2" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev_public_rt"
        }
      + tags_all         = {
          + "Name" = "dev_public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + arn                    = (known after apply)
      + description            = "public security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.123.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Repository" = "new2"
        }
      + tags_all                                       = {
          + "Repository" = "new2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.mtc_vpc will be created
  + resource "aws_vpc" "mtc_vpc" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.123.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = true
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = {
          + "Name" = "dev23"
        }
      + tags_all                       = {
          + "Name" = "dev23"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - dev_ip1       = "test131" -> null
  + dev_ip4       = "test132"
  - randomoutput2 = "dummy" -> null
[01JVSGWCS7CT8A56D47VDD3EC1] Changes are GO
[01JVSGWCS7CT8A56D47VDD3EC1] Uploading the list of managed resources...
[01JVSGWCS7CT8A56D47VDD3EC1] Please be aware that the run changes calculation includes output changes.
[01JVSGWCS7CT8A56D47VDD3EC1] Resource list upload is GO
[01JVSGWCS7CT8A56D47VDD3EC1] Generating JSON representation of the plan...
[01JVSGWCS7CT8A56D47VDD3EC1] JSON representation is GO
[01JVSGWCS7CT8A56D47VDD3EC1] Loading custom plan policy inputs...
[01JVSGWCS7CT8A56D47VDD3EC1] 0 custom plan policy inputs found
[01JVSGWCS7CT8A56D47VDD3EC1] No plan policies to evaluate
```
